In [5]:
import pandas as pd

# create a simple series
s = pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
data={
    'Name': ['Alice','Bob','Charlie'],
    'Age':[24,27,22],
    'City':['New York','Los Angeles','Chicago']
}
df= pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [7]:
# Select a single column
print(df['Name'])

# Select multiple columns
print(df[['Name','Age']])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Age
0    Alice   24
1      Bob   27
2  Charlie   22

In [8]:
# Select first two rows
print(df.iloc[:2])

# Select rows by label index
print(df.loc[1])

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles
Name            Bob
Age              27
City    Los Angeles
Name: 1, dtype: object

In [9]:
df.iloc[2]

Name    Charlie
Age          22
City    Chicago
Name: 2, dtype: object

In [14]:
df['Age']>23
#print(df[])

0     True
1     True
2    False
Name: Age, dtype: bool

In [16]:
#df['Age']>23
print(df['Age']>23)

0     True
1     True
2    False
Name: Age, dtype: bool

In [18]:
data ={
    'Department':['HR','HR','IT','IT','Finance'],
    'Employee':['Alice','Bob','Charlie','David','Eve'],
    'Salary':[50000,52000,60000,62000,58000]
}
df= pd.DataFrame(data)
# Group by Department and calculate the mean salary
grouped= df.groupby('Department')['Salary'].mean()
print(grouped)

Department
Finance    58000.0
HR         51000.0
IT         61000.0
Name: Salary, dtype: float64

Q.) Create a dataframe and filter employees with salary>600000

In [21]:
data ={
    'Department':['HR','HR','IT','IT','Finance'],
    'Employee':['Alice','Bob','Charlie','David','Eve'],
    'Salary':[50000,52000,60000,62000,58000]
}
df= pd.DataFrame(data)
# Filter employees with Salary > 600000
high_salary=df[df['Salary']> 600000]
print(high_salary)

Empty DataFrame
Columns: [Department, Employee, Salary]
Index: []

In [22]:
df

  Department Employee  Salary
0         HR    Alice   50000
1         HR      Bob   52000
2         IT  Charlie   60000
3         IT    David   62000
4    Finance      Eve   58000

In [27]:
df.to_excel("test1.xlsx")

In [30]:
pd.read_excel("./test1.xlsx")

   Unnamed: 0 Department Employee  Salary
0           0         HR    Alice   50000
1           1         HR      Bob   52000
2           2         IT  Charlie   60000
3           3         IT    David   62000
4           4    Finance      Eve   58000
5           5        CFO       GP  999999

How to draw index or pre order index while reading excel files using pandas